Dlubal.DynamPro.NVCResultsModeShapesOnSurface
Natural Vibration Case results - Mode Shapes on surface

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.ModeShape
Number of mode shape

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.MeshPointNo
Number of FE mesh point in RFEM

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.LocationX
Location X[m] on surface

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.LocationY
Location Y[m] on surface

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.LocationZ
Location Z[m] on surface

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.Surface
Number of surface on which this node lies

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.StdDisplacementX
Standardized Displacement X [m]

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.StdDisplacementY
Standardized Displacement Y [m]

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.StdDisplacementZ
Standardized Displacement Z [m]

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.StdRotationX
Standardized rotation X [-]

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.StdRotationY
Standardized rotation Y [-]

Dlubal.DynamPro.NVCResultsModeShapesOnSurface.StdRotationZ
Standardized rotation Z [-]